DataProcessors/КартаOpenStreetMap.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>КартаOpenStreetMap</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТелеграмГеоданныеКонтакта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмГеоданныеКонтакта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>latitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>longitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/КартаOpenStreetMap/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ИнициализироватьКарту(КодМаршрута = "")

	Текст = ПолучитьТекстМакета("МакетOSR");
	
	ШиротаЦентр = "48.7520";
	ДолготаЦентр = "37.5976";
	Текст = СтрЗаменить(Текст, "&ШиротаЦентр", ШиротаЦентр);
	Текст = СтрЗаменить(Текст, "&ДолготаЦентр", ДолготаЦентр);
	ТекстHTML = СтрЗаменить(Текст, "&КодМаршрута", КодМаршрута);

КонецПроцедуры

//ТаблицаТочек имеет 2 колонки Широта(Число), Долгота(Число)
Функция ДобавитьНаКартуТочки(КодМаршрута, ТаблицаТочек)
	
	КодМаршрута = КодМаршрута + "var latlngs = [";
	
	КолИтераций = 0;
	Для Каждого Точка Из ТаблицаТочек Цикл
		КолИтераций = КолИтераций + 1;
		Если КолИтераций = 1 Тогда
			КодМаршрута = КодМаршрута + "[" + Формат(Точка.Широта, "ЧЦ=15; ЧДЦ=12; ЧРД=.; ЧГ=0")+", "+Формат(Точка.Долгота, "ЧЦ=15; ЧДЦ=12; ЧРД=.; ЧГ=0") + "]";
		Иначе
			КодМаршрута = КодМаршрута + ",[" + Формат(Точка.Широта, "ЧЦ=15; ЧДЦ=12; ЧРД=.; ЧГ=0")+", "+Формат(Точка.Долгота, "ЧЦ=15; ЧДЦ=12; ЧРД=.; ЧГ=0") + "]";
		КонецЕсли;	
	КонецЦикла;
	КодМаршрута = КодМаршрута + "];
		|	var polyline = L.polyline(latlngs, {color: 'red', weight: 5, opacity: 0.7}).addTo(map);
		|	map.fitBounds(polyline.getBounds());
		|	";
		
	
КонецФункции


&НаСервере
Процедура ОбновитьНаСервере()
	
	ПоследниеГеоданные = РегистрыСведений.ТелеграмГеоданныеКонтакта.ПолучитьПоследнее(,Новый Структура("ТелеграмКонтакт", Объект.ТелеграмКонтакт));	
	
	
	КодМаршрута = "L.marker(["+Формат(ПоследниеГеоданные.latitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0")+", "+Формат(ПоследниеГеоданные.longitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0")+"], {title: '" + Строка(Объект.ТелеграмКонтакт) + "'}).addTo(map);
		|	";

	Текст = ПолучитьТекстМакета("МакетOSR");
	
	ШиротаЦентр = Формат(ПоследниеГеоданные.latitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0");
	ДолготаЦентр = Формат(ПоследниеГеоданные.longitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0");
	
	Текст = СтрЗаменить(Текст, "&ШиротаЦентр", ШиротаЦентр);
	Текст = СтрЗаменить(Текст, "&ДолготаЦентр", ДолготаЦентр);
	ТекстHTML = СтрЗаменить(Текст, "&КодМаршрута", КодМаршрута);


КонецПроцедуры

&НаСервере
Функция ПолучитьТекстМакета(ИмяМакета)

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	Результат = Макет.ПолучитьТекст();
	Возврат Результат;

КонецФункции

&НаСервере
Процедура КартаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КартаПриИзменении(Элемент)
	КартаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КартаДокументСформированНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КартаДокументСформирован(Элемент)
	КартаДокументСформированНаСервере();
КонецПроцедуры

&НаСервере
Процедура КартаПриНажатииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КартаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КартаПриНажатииНаСервере();
КонецПроцедуры
